# -*- coding: utf-8 -*-
import os
import time

from laya import Router

os.environ['HF_HUB_DISABLE_PROGRESS_BARS'] = '1'
router = Router()

samples = [
    '人民の人民による人民のための政治',
    'アルミ缶の上にあるミカン',
    'トンネルを抜けるとそこは雪国であった',
    '智代子のチョコ',
    '布団が吹っ飛んだ',
    '我輩は猫である',
    '猫が寝転んだ',
    'その意見にはついていけん',
    '靴を靴箱に入れる',
    '傘を貸さない',
    'イカは如何なものか',
    '親譲りの無鉄砲で子供の時から損ばかりしている',
    'マイケル・ジョーダンが冗談を言った',
    '景気のいいケーキ',
    '富士急ハイランドに気軽に入らんと楽しめない',
    '後鳥羽上皇の仕事場',
    'バンダナの出番だな',
    '知事が縮む',
    # ここからドラクエ10
    'バニーちゃんに そバニーいてほしい!',
    'どのキメラにするか キメラれない!',
    'ルカナンでも となえるかなん!',
    'うちのやどやはどうや! ドヤァ!',
    'ミミックに 耳くわれた!',
    'しゃっきりレタスが とれたっす!',
    'すてみでも すてみようかな。',
    'ドラキー 来たけど ラッキー!',
    'スライムは つらいむ!',
    '黄泉送り よう見送り!',
    'ガタラ民には 我慢が足らない!',
    '戦士が 戦死した!',
    'これはタンスの中に あったんス!',
    'アサシンダガーで 朝 しんだがあ!',
    'ガニラスが言った。ルカニは いるカニ？',
    'ランガーオ村の人に 知らんガオされた!',
    'どぐがのこなでも 買っどくが!',
    '教会に行くのは 今日かい？',
    'ネクロバルサは 寝転がるさ!',
    '賢者を はっけんじゃ!',
    '自由列島 ジュレット!',
    'モーモンの ごーもん!',
    '井戸の中は いいどー!',
    'ダーマ神殿で ダーマされたよ!',
    'ドワーフが ドアふいた!',
    'カムシカが冷たい。シカトされちゃった!',
    'ラッカランの天気は 今日もうららっからん!',
    'ツスクルに建つ スクール!',
    'わたし 魔女なの!まじよ!',
    'はがねのつるぎの 刃がねーぞ!',
    'かぶとを かぶっとる!',
    '１ゴールドで イチゴ 売るどー!',
    '洞くつで 銅のくつを 盗掘!',
    'バトルマスターが いばっとりますたー!',
    'くさった死体を たおしたい!',
    'どうぐ使いの家 洞くつかい!',
    'マジステッキ まじステッキ!',
    'オーガの王が おがんだ!',
    'チャージタックルで ひったっくる!',
    'そんなステテコパンツ もうステテコい!',
    'くさりかたびらの くさりかた!',
    'スカラを使って すかられた!',
    'エルフが ふるえる 冬!',
    'いばらのムチくらいで いばらんといて!',
    'マジ感動だ! カンダタがワリカンだった!',
    'カーレルの氷雪洞に 行かーれるの？',
    '波紋演舞は もうええんぶ？',
    'アルカナは あるかな？',
    'ゲルト海峡で泳げると。そりゃ快挙うだ!',
    '武闘家だらけの 舞踏会!',
    '錬金術師は 連勤尽くし!',
    '魔剣には まけんぞ!',
    'プクリポの雇用は プクリポウセイがいい!',
    'やくそうを 焼くぞう!',
    'もっと 魔法を 使いまほう!',
    'スーパースターの 好きなスープパスター!',
    'メギストリスで毎日並ぶのはメガストレス!',
    'メーダロードが強い？ あたりめーだろー!',
    'ナルビアの町になるビワ!',
    'アグラニで食べた フォアグラにあたった!',
    'アームライオンの人生 つらいおん!',
    'いつ来ても 火事のカジノ!',
    'お疲れサーマリ高原です!',
    'てっかめんを 手で つかめん!',
    '武器屋のくせに ぶきやうだな!',
    'オルフェアで開催中の タオルフェア!',
    'グレン領では はぐれんようにな!',
    '王都カミハルムイで 会オウトする!',
    'チリが どこにいるか チリませんか？',
    'メタルスライムを しとメタル!',
    '魔塔で みんなを 待とう!',
    'ナスビナーラを なすりつける!',
    'レーンの村人は 信じらレーン!',
    'ムッチリした ムチは キムチイイぞ!',
    'あくま神官て たくましいんかん？',
    'レンドアの 開けられんドア!',
    'ウェディたちよ ウェディゴー!',
    'ギガンテスには きかんです!',
    'オルセコ闘技場に おるセコい奴!',
    'メーダが 目立っちゃ だメーだろう!',
]

questions = {
    'pun': {
        'type': 'noul',
        # 'instructions': 'この文章は日本語のダジャレですか?',
        # 'instructions': '日本語の語呂合わせ、同音異義語、似た音の語を利用した言葉遊びを含む文章ですか?',
        'instructions': 'この文章には発音が同じまたは非常によく似た別の意味の言葉を利用した言葉遊びがありますか?',
    },

    # 'pun': {
    #     'type': 'choice',
    #     # 'instructions': 'この文章を分類してください。',
    #     'instructions': '日本語の語呂合わせ、同音異義語、似た音の語を利用した言葉遊びを含む文章ですか?',
    #     'criteria': {
    #         'pun': '日本語の語呂合わせ、同音異義語、音の似た語を利用した言葉遊び',
    #         'not_pun': '通常の文章。言葉遊びを意図していないもの',
    #     },
    # },
}

print(questions['pun']['instructions'])
for text in samples:
    begin = time.perf_counter()

    result = router.predict(text, questions)
    answers = result['answers']['pun']

    if answers['type'] == 'noul':
        probability = result['answers']['pun']['noul']
    elif answers['type'] == 'choice':
        probability = result['answers']['pun']['probabilities']['pun']

    elapsed = time.perf_counter() - begin

    print(f'{probability:.3f} {elapsed:.3f} {text}')
