# -*- coding: utf-8 -*-
import os
import time

import ollama

samples = [
    '人民の人民による人民のための政治',
    'アルミ缶の上にあるミカン',
    'トンネルを抜けるとそこは雪国であった',
    '智代子のチョコ',
    '布団が吹っ飛んだ',
    '我輩は猫である',
    '猫が寝転んだ',
    'その意見にはついていけん',
    '靴を靴箱に入れる',
    '傘を貸さない',
    'イカは如何なものか',
    '親譲りの無鉄砲で子供の時から損ばかりしている',
    'マイケル・ジョーダンが冗談を言った',
    '景気のいいケーキ',
    '富士急ハイランドに気軽に入らんと楽しめない',
    '後鳥羽上皇の仕事場',
    'バンダナの出番だな',
    '知事が縮む',
    '庶民は今そこにある機器で遊びます ハリソン・フォードは出てこない',
    '灌漑が設置されて感慨が深い',
    '和やかに終わりたい',
    'ていねっていいね',
    # ここからドラクエ10
    'バニーちゃんに そバニーいてほしい!',
    'どのキメラにするか キメラれない!',
    'ルカナンでも となえるかなん!',
    'うちのやどやはどうや! ドヤァ!',
    'ミミックに 耳くわれた!',
    'しゃっきりレタスが とれたっす!',
    'すてみでも すてみようかな。',
    'ドラキー 来たけど ラッキー!',
    'スライムは つらいむ!',
    '黄泉送り よう見送り!',
    'ガタラ民には 我慢が足らない!',
    '戦士が 戦死した!',
    'これはタンスの中に あったんス!',
    'アサシンダガーで 朝 しんだがあ!',
    'ガニラスが言った。ルカニは いるカニ？',
    'ランガーオ村の人に 知らんガオされた!',
    'どぐがのこなでも 買っどくが!',
    '教会に行くのは 今日かい？',
    'ネクロバルサは 寝転がるさ!',
    '賢者を はっけんじゃ!',
    '自由列島 ジュレット!',
    'モーモンの ごーもん!',
    '井戸の中は いいどー!',
    'ダーマ神殿で ダーマされたよ!',
    'ドワーフが ドアふいた!',
    'カムシカが冷たい。シカトされちゃった!',
    'ラッカランの天気は 今日もうららっからん!',
    'ツスクルに建つ スクール!',
    'わたし 魔女なの!まじよ!',
    'はがねのつるぎの 刃がねーぞ!',
    'かぶとを かぶっとる!',
    '１ゴールドで イチゴ 売るどー!',
    '洞くつで 銅のくつを 盗掘!',
    'バトルマスターが いばっとりますたー!',
    'くさった死体を たおしたい!',
    'どうぐ使いの家 洞くつかい!',
    'マジステッキ まじステッキ!',
    'オーガの王が おがんだ!',
    'チャージタックルで ひったっくる!',
    'そんなステテコパンツ もうステテコい!',
    'くさりかたびらの くさりかた!',
    'スカラを使って すかられた!',
    'エルフが ふるえる 冬!',
    'いばらのムチくらいで いばらんといて!',
    'マジ感動だ! カンダタがワリカンだった!',
    'カーレルの氷雪洞に 行かーれるの？',
    '波紋演舞は もうええんぶ？',
    'アルカナは あるかな？',
    'ゲルト海峡で泳げると。そりゃ快挙うだ!',
    '武闘家だらけの 舞踏会!',
    '錬金術師は 連勤尽くし!',
    '魔剣には まけんぞ!',
    'プクリポの雇用は プクリポウセイがいい!',
    'やくそうを 焼くぞう!',
    'もっと 魔法を 使いまほう!',
    'スーパースターの 好きなスープパスター!',
    'メギストリスで毎日並ぶのはメガストレス!',
    'メーダロードが強い？ あたりめーだろー!',
    'ナルビアの町になるビワ!',
    'アグラニで食べた フォアグラにあたった!',
    'アームライオンの人生 つらいおん!',
    'いつ来ても 火事のカジノ!',
    'お疲れサーマリ高原です!',
    'てっかめんを 手で つかめん!',
    '武器屋のくせに ぶきやうだな!',
    'オルフェアで開催中の タオルフェア!',
    'グレン領では はぐれんようにな!',
    '王都カミハルムイで 会オウトする!',
    'チリが どこにいるか チリませんか？',
    'メタルスライムを しとメタル!',
    '魔塔で みんなを 待とう!',
    'ナスビナーラを なすりつける!',
    'レーンの村人は 信じらレーン!',
    'ムッチリした ムチは キムチイイぞ!',
    'あくま神官て たくましいんかん？',
    'レンドアの 開けられんドア!',
    'ウェディたちよ ウェディゴー!',
    'ギガンテスには きかんです!',
    'オルセコ闘技場に おるセコい奴!',
    'メーダが 目立っちゃ だメーだろう!',
    # 源平討魔伝 by @arctanx93
    '駄洒落ばかり言ってるのはだじゃれ?',
    '要石にはかなうめえ'
    '巻物はお前をすくうろうる',
    '矢はやだ',
    '餓鬼がきた',
    'ムカデがむかっでくる',
    'つづらがつづらっと並んでいる',
    'かねがね金がねえ',
    '曲がったままの勾玉',
    'この先は闇の国 行くのはやみろ やみろっつうの',
    '灯籠見つかったか',
    '魔神は暇人',
    'この鳥居をお通りなされ',
]

questions = {
    'pun': {
        'type': 'choice',
        'instructions': 'この文章は日本語のダジャレですか?',
        "criteria": {
            '音韻': '同音・近音語の掛け合わせ',
            '語義': '同じ語の別義を利用',
            '置換': '既知のタイトル・定型句の一部を変えている',
            '引用': '元ネタを持ち込んで一部を置換している',
            '参照': '元ネタを持ち込まず想起させている',
            'joke': 'その他状況・意外性・皮肉など',
        },
    },
}

envs = os.environ
model = envs['MODEL'] if envs.get('MODEL') else 'laya'

print(model, questions['pun']['instructions'])
try:
    for text in samples:
        begin = time.perf_counter()

        response = ollama.systemone(
            model=model,
            state=text,
            questions=questions,
            keep_alive='5m',
        )
        answers = response.answers['pun']
        choice = answers.choice
        confidence = answers.probabilities[choice]
        print(f'{choice} {confidence:.3f} {time.perf_counter() - begin:.3f} {text}')
except (KeyboardInterrupt, ollama.ResponseError) as e:
    print(e)
